// =======================================
//
// p10872 [팩토리얼]
//
// [문제]
// 0보다 크거나 같은 정수 N이 주어진다. 이때, N!을 출력하는 프로그램을 작성하시오.
//
// [입력]
// 첫째 줄에 정수 N(0 ≤ N ≤ 12)이 주어진다.
// 첫째 줄에 N!을 출력한다.
//
// [https://www.acmicpc.net/problem/10872]
//
// =======================================
// IMPORT
// =======================================
use std::fmt::Write;
use std::io::{stdin, Read};

fn factorial(n: i32) -> i32 {
    if n <= 1 {
        return 1;
    }

    n * factorial(n - 1)
}

fn main() {
    // =======================================
    // INPUT
    // =======================================
    let mut buf = String::new();
    stdin().read_line(&mut buf).unwrap();

    let n = buf.trim().parse::<i32>().unwrap();
    let res = factorial(n);

    // =======================================
    // OUTPUT
    // =======================================
    print!("{res}");
}
