// =======================================
//
// p10872 [팩토리얼]
//
// [문제]
// 0보다 크거나 같은 정수 N이 주어진다. 이때, N!을 출력하는 프로그램을 작성하시오.
//
// [입력]
// 첫째 줄에 정수 N(0 ≤ N ≤ 12)이 주어진다.
// 첫째 줄에 N!을 출력한다.
//
// [https://www.acmicpc.net/problem/10872]
//
#include <stdio.h>

int factorial(int n)
{
	if (n == 0)
	{
		return 1;
	}
	if (n == 1 || n == 2)
	{
		return n;
	}
	return factorial(n - 1) * n;
}

int main()
{
	// =======================================
	// INPUT
	// =======================================
	int n;
	scanf("%d", &n);

	// =======================================
	// OUTPUT
	// =======================================
	int r = factorial(n);
	printf("%d\n", r);

	return 0;
}
